Tekla Open API Reference for Tekla Structures 2025
GeometricPlane Constructor (Point, Vector)
 Instantiates a plane defined by the given origin point and normal vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GeometricPlane(
	Point Origin,
	Vector Normal
)
Public Sub New (
	Origin As Point,
	Normal As Vector
)
Parameters
Origin
Type: Tekla.Structures.Geometry3d.Point
The origin point to be used.
Normal
Type: Tekla.Structures.Geometry3d.Vector
The normal vector to be used.
See Also
Reference
GeometricPlane Class
GeometricPlane Overload
Tekla.Structures.Geometry3d Namespace